01  WS-AREA. 
    05  WS-COUNT PIC 9(5) VALUE 0. 
    05  WS-TABLE OCCURS 100 TIMES. 
       10  WS-ENTRY PIC X(80). 

PROCEDURE DIVISION. 

PERFORM VARYING WS-INDEX FROM 1 BY 1 UNTIL WS-INDEX > 100 
    MOVE 'Record ' & WS-INDEX TO WS-TABLE(WS-INDEX) 
    ADD 1 TO WS-COUNT 
END-PERFORM. 

DISPLAY 'Count: ' WS-COUNT. 
STOP RUN.